СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_НастройкиОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СМП_НастройкиОбменов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляПолучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_ВидыПоказателейСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СМП_ВидыПоказателейСверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/Свойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Свойства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Объекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индексирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыЧисла_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыЧисла_Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыЧисла_Неотрицательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыСтроки_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыСтроки_Фиксированная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыДаты_Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторегистрация</Name>
					<Comment>Признак авторегистрации элемента состава плана обмена; Истина – авторегистрация разрешена; Ложь – запрещена</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМП_ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Типы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/СМП_ПравилаСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СМП_ПравилаСверки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМП_ВидыПоказателейСверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Допуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информативный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/CommonModules/СМП_ОнлайнОбменСверка/Ext/Module.bsl
#Область ПравилаСверки

// Возвращает описание объекта метаданных той базы, в которой выполняется код:
// для учетной записи ДляОтправки - источник ПКО, для ДляПолучения - приемник ПКО.
//
// Параметры:
//   ПКО - СправочникСсылка.ПравилаКонвертацииОбъектов - правило, которому подчинено правило сверки.
//
// Возвращаемое значение:
//   СправочникСсылка.Объекты - объект своей базы; пустая ссылка, если ПКО не указано.
//
Функция ОбъектСвоейБазы(ПКО) Экспорт
	
	Если Не ЗначениеЗаполнено(ПКО) Тогда
		Возврат Справочники.Объекты.ПустаяСсылка();
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПКО,
		Новый Структура("Источник, Приемник, НастройкаОбмена", "Источник", "Приемник", "Владелец.НастройкаОбмена"));
	
	Если Реквизиты.НастройкаОбмена = Перечисления.СМП_НастройкиОбменов.ДляПолучения Тогда
		Возврат Реквизиты.Приемник;
	КонецЕсли;
	
	Возврат Реквизиты.Источник;
	
КонецФункции // ОбъектСвоейБазы

// Проверяет, есть ли среди типов свойства (описание метаданных КД2) ссылочный тип.
//
// Параметры:
//   Свойство - СправочникСсылка.Свойства - реквизит объекта метаданных.
//
// Возвращаемое значение:
//   Булево - Истина, если хотя бы один тип свойства - ссылка ("СправочникСсылка.Х", "ПеречислениеСсылка.Х" и т.п.).
//
Функция СвойствоИмеетСсылочныйТип(Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Признак
	|ИЗ
	|	Справочник.Свойства.Типы КАК Типы
	|ГДЕ
	|	Типы.Ссылка = &Свойство
	|	И Типы.Тип.Наименование ПОДОБНО ""%Ссылка.%""";
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // СвойствоИмеетСсылочныйТип

#КонецОбласти

#Область ВычислениеПоказателей

// Возвращает действующие правила сверки ПКО.
//
// Параметры:
//   ПКО - СправочникСсылка.ПравилаКонвертацииОбъектов - владелец правил.
//   КодыПоказателей - Массив из Строка, Неопределено - отбор по кодам; Неопределено - все правила.
//
// Возвращаемое значение:
//   ТаблицаЗначений - колонки: Код, Наименование, Вид, ИмяРеквизита, Выражение, Допуск, Информативный, Порядок.
//
Функция ПравилаСверки(ПКО, КодыПоказателей = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Код КАК Код,
	|	Правила.Наименование КАК Наименование,
	|	Правила.Вид КАК Вид,
	|	Правила.Реквизит.Наименование КАК ИмяРеквизита,
	|	Правила.Выражение КАК Выражение,
	|	Правила.Допуск КАК Допуск,
	|	Правила.Информативный КАК Информативный,
	|	Правила.Порядок КАК Порядок
	|ИЗ
	|	Справочник.СМП_ПравилаСверки КАК Правила
	|ГДЕ
	|	Правила.Владелец = &ПКО
	|	И НЕ Правила.ПометкаУдаления
	|	И НЕ Правила.Отключить
	|	И (НЕ &ОтборПоКодам
	|			ИЛИ Правила.Код В (&КодыПоказателей))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Код";
	Запрос.УстановитьПараметр("ПКО", ПКО);
	Запрос.УстановитьПараметр("ОтборПоКодам", КодыПоказателей <> Неопределено);
	Запрос.УстановитьПараметр("КодыПоказателей", ?(КодыПоказателей = Неопределено, Новый Массив, КодыПоказателей));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПравилаСверки

// Вычисляет показатели объекта по правилам сверки. Ошибка одного показателя не прерывает остальные.
//
// Параметры:
//   Объект - ДокументОбъект - объект, для которого вычисляются показатели.
//   Правила - ТаблицаЗначений - см. ПравилаСверки().
//
// Возвращаемое значение:
//   Соответствие - ключ: код показателя; значение: Структура со свойством Значение
//                  (см. НормализоватьЗначение()) или Ошибка (Строка).
//
Функция ВычислитьПоказатели(Объект, Правила) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого Правило Из Правила Цикл
		
		Попытка
			
			Если Правило.Вид = Перечисления.СМП_ВидыПоказателейСверки.Реквизит Тогда
				Значение = Объект[Правило.ИмяРеквизита];
			Иначе
				Значение = ВычислитьВыражение(Объект, Правило.Выражение);
			КонецЕсли;
			
			Если Не Правило.Информативный И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение)) Тогда
				ВызватьИсключение НСтр("ru = 'Показатель вернул ссылку: сверять ссылки можно только как информативный показатель.'");
			КонецЕсли;
			
			Результат.Вставить(Правило.Код, Новый Структура("Значение", НормализоватьЗначение(Значение)));
			
		Исключение
			
			Результат.Вставить(Правило.Код, Новый Структура("Ошибка", КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВычислитьПоказатели

// Вычисляет показатели документа по ссылке; если объект прочитать не удалось - ошибка на каждом показателе.
//
// Параметры:
//   Ссылка - ДокументСсылка - документ.
//   Правила - ТаблицаЗначений - см. ПравилаСверки().
//
// Возвращаемое значение:
//   Соответствие - см. ВычислитьПоказатели().
//
Функция ВычислитьПоказателиДокумента(Ссылка, Правила) Экспорт
	
	Если Правила.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Объект = Неопределено;
	ТекстОшибки = Неопределено;
	Попытка
		Объект = Ссылка.ПолучитьОбъект();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если Объект = Неопределено Тогда
		Если ТекстОшибки = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось прочитать документ.'");
		КонецЕсли;
		Результат = Новый Соответствие;
		Для Каждого Правило Из Правила Цикл
			Результат.Вставить(Правило.Код, Новый Структура("Ошибка", ТекстОшибки));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	
	Возврат ВычислитьПоказатели(Объект, Правила);
	
КонецФункции // ВычислитьПоказателиДокумента

// Сравнивает нормализованные значения показателя источника и приемника.
// Разные типы (в т.ч. пустое значение против 0) - расхождение; числа - с допуском; строки, даты, булево - точно.
//
// Параметры:
//   ЗначениеИсточник - Число, Строка, Булево, Неопределено - см. НормализоватьЗначение().
//   ЗначениеПриемник - Число, Строка, Булево, Неопределено - значение из ответа приемника.
//   Допуск - Число - допустимая разница для чисел.
//
// Возвращаемое значение:
//   Булево - Истина, если значения совпадают.
//
Функция ЗначенияСовпадают(ЗначениеИсточник, ЗначениеПриемник, Допуск) Экспорт
	
	Если ТипЗнч(ЗначениеИсточник) <> ТипЗнч(ЗначениеПриемник) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеИсточник) = Тип("Число") Тогда
		Разница = ЗначениеИсточник - ЗначениеПриемник;
		Возврат Макс(Разница, -Разница) <= Допуск;
	КонецЕсли;
	
	Возврат ЗначениеИсточник = ЗначениеПриемник;
	
КонецФункции // ЗначенияСовпадают

// Приводит значение показателя к виду, пригодному для JSON и сравнения между базами.
//
// Параметры:
//   Значение - Произвольный - вычисленное значение.
//
// Возвращаемое значение:
//   Число, Булево - как есть; Строка - без концевых пробелов; дата - строкой XMLСтрока;
//   Неопределено - для Неопределено и Null; прочее - представление строкой.
//
Функция НормализоватьЗначение(Значение) Экспорт
	
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Число") Или ТипЗначения = Тип("Булево") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат СокрЛП(Значение);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат XMLСтрока(Значение);
	КонецЕсли;
	
	Возврат СокрЛП(Строка(Значение));
	
КонецФункции // НормализоватьЗначение

// Вычисляет выражение правила в безопасном режиме. В выражении доступна переменная Объект.
// Безопасный режим выключается автоматически при выходе из функции.
//
// Параметры:
//   Объект - ДокументОбъект - контекст выражения.
//   Выражение - Строка - выражение встроенного языка (одно выражение, без операторов).
//
// Возвращаемое значение:
//   Произвольный - результат выражения.
//
Функция ВычислитьВыражение(Объект, Выражение)
	
	УстановитьБезопасныйРежим(Истина);
	Возврат Вычислить(Выражение);
	
КонецФункции // ВычислитьВыражение

#КонецОбласти
